Repository: eugeneai/books
Catalog: intech-mda/ru-en/omegat/project_save.tmx
Source language: ru_ru
Languages: en_gb

source: # ВЫВОДЫ
en_gb: # CONCLUSION

source: # МЕТОДОЛОГИЯ ТРАНСФОРМАЦИИ МОДЕЛЕЙ
en_gb: # METHODOLOGY OF MODEL TRANSFORMATIONS

source: # ПРИМЕНЕНИЕ ТЕХНОЛОГИИ СИНТЕЗА КАРКАСА ИНФОРМАЦИОННОЙ СИСТЕМЫ ДЛЯ СОЗДАНИЯ МЕДИЦИНСКОЙ ИНФОРМАЦИОННОЙ СИСТЕМЫ «ПОПУЛЯЦИОННЪ|Й РАКОВЫЙ РЕГИСТР»
en_gb: # APPLICATION OF THE TECHNOLOGY OF SYNTHESIS OF A framework OF THE INFORMATION SYSTEM "POPULATION CANCER REGISTRY"

source: # Способы трансформации
en_gb: # Transformation approaches

source: # ТРАНСФОРМАЦИЯ МОДЕЛЕЙ НА ОСНОВЕ ЛОГИЧЕСКИХ ПРАВИЛ
en_gb: # TRANSFORMATION as a knowledge based system

source: ## Информационные потоки
en_gb: ## Information flows

source: API-интерфейс взаимодействия с БД ИС;
en_gb: API for the database and IS interaction;

source: CI M~-- максимально общая и не зависимая от реализации системы модель.
en_gb: CIM is to be as general as possible and not dependent on the implementation of the systems.

source: Ho XMI разрабатывался прежде всего, как стандарт хранения и обмена ЬМ1~-- данными, он сложен для чтения и понимания пользователем.
en_gb: (SHT)Howewer, XMI was developed primarily as a data format, it is difficult to read and understand by programmer.

source: MDA имеет преимущество по сравнению со стандартными подходами к разработке ПО за счет того, что для перехода к PSM можно использовать стандартные описания трансформаций.
en_gb: (SHT) MDA has the advantage over standard approaches to software development due to the fact that the transition to PSM can be reached by means of the standard descriptions of transformations.

source: OCL является частью спецификации UML.
en_gb: (SKIP)

source: OCL является частью спецификации UML.~OCL"=выражения позволяют задавать критерии непротиворечивости UMLмодели в целом, а также свойства отдельных элементов этой модели (например, вычислимые атрибуты классов).
en_gb: Consistency criteria and preperties of model structure elements are defined with OCL, such as.

source: OCL"=выражения позволяют задавать критерии непротиворечивости UMLмодели в целом, а также свойства отдельных элементов этой модели (например, вычислимые атрибуты классов).
en_gb: (?) Consistency criteria and preperties of model structure elements are defined with OCL, such as.

source: PSM является моделью каркаса ИС, в которой функции ИС представлены с учетом специфики и свойств заданной программно"=аппаратной платформы.
en_gb: PSM is a framework model of the IS, where the IS functionality is represented taking into account the properties of the target software and hardware implementation platform.

source: PSM"=модель ИС представляется в виде UML"=диаграммы.
en_gb: UML is used for IS description.

source: SQL"=запросы для создания таблиц БД, создания, редактирования, удаления записей в эти таблицы;
en_gb: the SQL queries for DB tables creation, and create, edit, delete statements for table records manitpulation;

source: XMI обеспечивает обмен данными (моделями) между различными инструментами и средами разработки.
en_gb: XMI provides the exchange of data (models) between different tools and development environments.

source: Автоматизация ведения ракового регистра путем внедрения информационных технологий в организацию и деятельность органов и учреждений здравоохранения в современных условиях является важнейшим инструментом реализации государственной политики по обеспечению населения качественной медицинской помощью.
en_gb: (REV) Automation of the management of the cancer register through the introduction of information technologies in the organization and activities of bodies and institutions of health in modern conditions is the most important instrument of realization of state policy on providing the population with qualitative medical aid.

source: Архитектура и требования к ИС представляются как объектная информационная модель, выраженная в виде диаграммы классов языка UML.
en_gb: Architecture and requirements for IIS is represented as an object information model, expressed in the form of class diagrams of UML.

source: В PSMмодели происходит дальнейшая детализация PIM"=модели и добавление элементов, специфичных для конкретного способа реализации.
en_gb: PSM is constructed by means of adding details about target platform into PIM.

source: В UML объект может быть ассоциирован с другим объектом посредством бинарной связи.
en_gb: (SKIP)

source: В UMLдиаграмме возможно задание ограничений на сущности модели с помощью как естественного, так и формального языков.
en_gb: (about compromize OCL representation of formatm mat theory of sets and informal natural languages....for constraint definition.)

source: В МИС ПРР предложены механизмы взаимодействия со сторонними программами, обеспечивающими ведение и сопровождение регистра.
en_gb: Mechanisms of interaction with third-party programs providing functioning and maintenance of the register are implemented.

source: В МИС ПРР реализуются следующие информационные потоки (рис.
en_gb: In the HCIS, the following information flows are implemented (Figure

source: В данной модели описываются общие требования к системе, словарь используемых понятий и условия функционирования (окружение).
en_gb: CIM describes general requirements to the system, dictionary of the terms used, and operating conditions (the environment).

source: В данном случае это и представляет собой PIM.
en_gb: In this case it represents the PIM.

source: В зависимости от правил, задающих требования к программно"=аппаратной платформе, и имеющихся шаблонов программного кода среды функционирования возможно порождение нескольких вариантов реализации одной ИС.
en_gb: Depending on the rules that specify the requirements for target platform and the existing code templates, a number of implementations of the same IS can be generated.

source: В настоящее время во всем мире отмечается рост уровня онкологических заболеваний.
en_gb: Currently, worldwide there is a growing level of cancer.

source: В предложенном подходе к реализации MDA генерирование программного кода осуществляется при помощи последовательной трансформации исходной модели ИС.
en_gb: (ATL,Stratego)We use the approach, where generating program code is performed using a sequential transformation of the original model of IS.

source: В рассматриваемом далее подходе к реализации MDA не используются CIMмодели.
en_gb: We have no experience of usage CIM in IS specifications, but \ldots.

source: В соответствии с MDA рекомендуется доводить PIM до высокой степени детализации, вплоть до использования высокоуровневого платформенно"=независимого языка программирования для описания функций ИС.
en_gb: According to MDA, PIM is recommended to contain a high degree of detail, and use a high-level platform independent programming language for describing IS functions.

source: В соответствии с MDA рекомендуется доводить PIM до высокой степени детализации, вплоть до использования высокоуровневого платформенно"=независимого языка программирования для описания функций ИС.~Однако в спецификации MDA предписывается отличать детали, описывающие поведение системы с точки зрения пользователя, от деталей ее практической реализации: последние не должны присутствовать в платформенно"=независимой модели.
en_gb: According to MDA, PIM is recommended to contain a high degree of detail, and use a high-level platform independent programming language for describing IS functions. However, in the MDA specifications, the details of describing the behavior of the system from the user point of view must be free of thee details of its implementation: the latter should not be present in the PIM.

source: В соответствии со спецификацией MDA программный код библиотек каркаса ИС должен порождаться автоматически на основе информационной и структурной моделей ИС.
en_gb: In accordance with the specification of the MDA subsystem code of IS framework should be generated automatically on the basis of information and structural models of IS.

source: В соответствии со спецификацией стадия составления CIM не является обязательной и носит лишь рекомендательный характер.
en_gb: MDA does not prescribe the construction of CIM in every project and it is optional.

source: В таком формате документ поступает на вход транслятора, обеспечивающего его трансформацию и последующий синтез программного кода.
en_gb: In this format of the document is passed as input to the translator, providing the transformation and subsequent synthesis of the program source code.

source: В частности, можно представить UML"=модель в виде графа и использовать математический аппарат трансформации графов \cite{b102}.
en_gb: The UML model can be represented as graph, then the transformation can be described with mathematical apparatus of manipulation of graph structures\cite{b102}.

source: Во время разработки ни одна модель не остается неизменной.
en_gb: (SHT) During development, no model is unchanged.

source: Возможности практически любого UML"=редактора (Poseidon, Umbrella, Rational Rose и др.) позволяют сохранить модель в виде XML"=документа.
en_gb: Almost any UML editor, e.g., Poseidon for UML, Umbrello, Rational Rose, etc. have options for saving the model as XMI document.

source: Генерирование программного кода осуществляется при помощи последовательной трансформации исходной модели ИС.
en_gb: Generating program code is performed using a sequential transformation of the original model of IS.

source: Главный недостаток такого подхода состоит в том, что в нем используется собственный понятийный аппарат, не имеющий отношения к UML"=моделированию.
en_gb: The main drawback of this approach is that it uses its own conceptual apparatus, not related to UML modeling.

source: Данная база знаний и процедура трансформации фактически являются моделью программно"=аппаратной платформы, для которой реализуется ИС.
en_gb: This knowledge base and procedure of transformation are in the PM of a target software and hardware platform on which the IS under development is to be deployed.

source: Данная технология позволяет оперативно адаптировать ИС к изменяюшимся требованиям по ведению ракового регистра, а также к возможным изменениям программно"=аппаратной реализации.
en_gb: This technology allows one quickly adapt the IS to changes in the requirements for the cancer register functionality, as well as the target deployment platform.

source: Данный регистр формируется на основе данных, получаемых в регионах России.
en_gb: This register is aggragated on data obtained in the regions of Russia.

source: Данный язык схож своим синтаксисом с объектно"=ориентированными языками программирования.
en_gb: (SKIP)

source: Для ХМI существует несколько хорошо развитых методик трансформации, в частности, XSLT u XQuery.
en_gb: There are several well-developed techniques of transformation for XML, they are based on technologies XSLT, XPath and XQuery (!! Deabbreviate).

source: Для задания и вычисления OCL"=выражений всегда требуется некоторый контекст, определяемый с помощью имени типа экземпляра или класса.
en_gb: The OCL constraint is defined within a context denoted as a name of instance or class.

source: Для задания однозначно интерпретируемых формальных ограничений можно использовать методы теории множеств, алгебры логики и других математических структур.
en_gb: The sets theory and mathematical language are the means of construction of the precise uniquely interpreted formalisms for a constraint definition language, but it is not convenient for a regular programmer.

source: Для профилактики, учета данного вида заболеваний, анализа эфективности проводимого лечения в России создана система Государственного ракового регистра.
en_gb: For prevention of this kind of disease and analysis of the effectiveness of the treatment, a system of State cancer registry is being developed in Russia.

source: Для реализации ИС в рамках MDA"=подхода предложена технология, основанная на применении формализованных знаний в процессе трансформации моделей.
en_gb: (SKIP)

source: Для реализации рассмотренного MDA"=подхода к созданию ИС предложена технология, основанная на применении формализованных знаний в процессе трансформации моделей.
en_gb: Our approach to PIM-PSM transformation is constructed with knowledge based systems.

source: Для трансформации UML"=модели можно преобразовать ее в ХМI"=представление, выполнить трансформацию средствами работы с XML u затем преобразовать результат обратно в UML.
en_gb: (SHT)UML model is represented in XMI, then transformed with XML tools, and then the results are converted back into UML.

source: Для этого необходимо сохранять информацию о ходе трансформации и о получившихся в процессе трансформации зависимостях между элементами модели, чтобы специализированный инструмент редактирования UML мог использовать эту информацию для автоматического поддержания соответствия между моделями.
en_gb: The information about the progress of transformation and the process of transformation of dependencies between model elements must be kept, and a specialized editing tool of UML colud use this information to automatically maintain consistency between the models.

source: Другой подход~-- использование уже разработанных механизмов трансформаций и преобразований.
en_gb: (SHT) Another approach is the use of already developed mechanisms of transformation.

source: Ее использование позволяет значительно автоматизировать документооборот по ведению регистра.
en_gb: Its use automates workflow of management of the register significantly.

source: Если бы для каждой системы трансформацию приходилось описывать заново, это оказалось бы даже менее эффективно, чем переход от PIM к PSM вручную.
en_gb: (SHT, SKIP) If for each system the transformation had to describe again, it would have been even less effective than the transition from the PIM to the PSM manually.

source: Если у больного установлена четвертая стадия заболевания, то на него заполняется документ «Протокол запущенности».
en_gb: If the fourth stage of the disease was determined, then the document "Protocol of neglect" is filled in.

source: Еще один вариант заключается в использовании методик трансформации XML"=документов и стандарта XMI.
en_gb: Another approach to transformation representation is to use the XML languages for UML model representation (XMI standard) and technologies of its manipulation.

source: Желательно, чтобы в языке были предусмотрены средства для настройки и параметризации трансформации, не требующей кардинальной переделки всего описания трансформации.
en_gb: (SHT) The language has to include the means of the configuration and parameterization of the transformation, which do not require radical alterations in all the description of the transformation.

source: И наконец, подобный подход означает, что для каждой среды разработки придется писать полный набор описаний трансформаций для всех популярных технологий, вместо того чтобы использовать стандартные описания трансформаций, созданные независимыми разработчиками.
en_gb: (SHT) And finally, for each development environment the developer will have to cinstruct a complete set of descriptions of the transformations for all popular technologies, instead of using standard ones created by independent developers.

source: ИС является «клиент"=серверным» Web"=ресурсом с поддержкой кроссплатформенности.
en_gb: (SKIP)

source: Из"=за того, что трансформация описывается в терминах XML, а не UML, большая часть описания трансформации оказывается направленной на то, чтобы в результате получить XML"=документ, соответствующий стандарту ХМ1 \cite{b145}, а не на собственно описание трансформации U M L.
en_gb: Due to the fact that the transformation is described in terms of XML, not the source UML, a large part of the description of the transformation is to supply the result to be converted back to XMI \cite{b145}, the actual description of the transformation (??) gets lost within.

source: Изменения МИС проводятся путем модификации модели и/или способов ее трансформации.
en_gb: Changes of HCIS are carried out by modifying the model and/or it transformation.

source: Использование формализованного представления модели позволяет упростить разработку интерфейсов для реализации экспорта данных из унаследованных (ранее используемых ИС) для обеспечения целостности массива данных, представленных в ИС.
en_gb: The use of formalized representation of the model allows one to simplify the development of interfaces for data import from legacy, and to ensure the integrity of the dataset presented in the IS.

source: Как вариант задания ограничений над объектами UML"=модели используется формальный язык OCL.
en_gb: OCL is a compramise formalism that aloso supports the object-oriented traditions.

source: Как вариант задания ограничений над объектами UML"=модели используется формальный язык OCL.~Данный язык схож своим синтаксисом с объектно"=ориентированными языками программирования.
en_gb: OCL is a compramise formalism that aloso supports the object-oriented traditions.

source: Как правило, данная модель реализуется на языке UML (Unified Modeling Language) [l46], а в дальнейшем обогащается и уточняется.
en_gb: This model is implemented frequently in Unified Modeling Language (UML) [l46], and further enriched and refined.

source: Как язык задания ограничений он используется для:
en_gb: (SKIP)

source: Кроме того, из"=за отсутствия единого стандарта описания трансформаций разные среды разработки неминуемо будут выполнять трансформации по"=разному даже для одной и той же технологической платформы, что может привести к возникновению случаев несовместимости и затруднит смену сред разработки: вместо зависимости от технологической платформы программист окажется в зависимости от выбранной им среды разработки.
en_gb: (SHT) This leads to dependability of the developer on the tools.

source: МИС ПРР обеспечивает полный цикл регистрации, учета, модификации данных, необходимых для ведения популяционного ракового регистра.
en_gb: HCIS PCF provides the full cycle of registration, accounting, data modification to conduct population cancer registry of regional scale.

source: Модель не должна содержать никаких сведений технического характера, описаний структуры и функционала системы.
en_gb: The model must not contain any information of technical nature, descriptions of data structures and functionality of the system. (Here we add Juring addition)

source: Можно отметить, что исходная UML"=модель может быть обогащена формализованными ограничениями, заданными на языке ОС1 (Object Constraint Language) [70, 156].
en_gb: The source PIM in a general case contains formalized constraints specified in the Object Constraint Language (OCL) [70, 156].

source: Можно сказать, что PSM является описанием ИС, представляющим ее на уровне программного кода, т.
en_gb: (SKIP PSM is a source code representation)

source: Можно сказать, что PSM является описанием ИС, представляющим ее на уровне программного кода, т.~е.
en_gb: (SKIP)

source: Можно сформулировать требования, которым должно соответствовать средство трансформации моделей для его применения в MDA:
en_gb: The requirements which should correspond to the software of transformation models for its application in MDA are as follows:

source: На основе порождающего программирования в рамках подхода MDA разработана оригинальная технология создания информационных систем, в которой программный код базовых подсистем (каркаса) ИС синтезируется по их формализованному описанию, представленному в виде UML"=модели.
en_gb: On the basis of generative programming and adaptation of MDA approach, an original technology of creating information systems has been developed, which supports software subsystems source code to be synthesized according to their formalized description represented as UML model.

source: На основе технологии синтеза каркаса информационной системы создана кроссплатформенная медицинская ИС «Популяционный раковый регистр» (МИС ПРР), выполненная в виде Web"=ресурса, удовлетворяющая требованиям, предъявляемым к системам Министерством здравоохранения РФ, и рекомендациям специалистов Государственного бюджетного учреждения здравоохранения «Иркутский областной онкологический диспансер» (ИООД).
en_gb: (REV) On the basis of the technology of synthesis IS framework, a cross-platform healthcare system "Population cancer registry" (HCIS PCR) is made in the form of a Web application that meets the requirements of the Ministry of health of the Russian Federation, and the recommendations of the experts of the State budgetary health care institution "Irkutsk Regional Oncology Dispensary".

source: Наглядность правил трансформации.
en_gb: Visibility rules of transformation.

source: Начальной стадией разработки является составление технического задания и выработка требований к создаваемой ИС.
en_gb: The initial stage of development is developing of technical specifications and requirements posed by IS.

source: Общая схема трансформации из PIM в PSM представлена на рис.
en_gb: A general scheme of PIM to PSM transformation is presented in Figure

source: Объектная модель обрабатывается сценарием, написанным и исполняемым в среде Python.
en_gb: The object model is processed by a script written in the Python programming language [python].

source: Ограничения задают свойства как предметной области разрабатываемой ИС, так и специфики ее реализации.
en_gb: they define the properties of the domain and its implementation perculiarities.

source: Ограничения, заданные на естественном языке, сложно однозначно интерпретировать.
en_gb: Usage of a natural language for constraint definition is not practical as its translators are complex and language terms are not uniquely interpreted.

source: Однако в спецификации MDA предписывается отличать детали, описывающие поведение системы с точки зрения пользователя, от деталей ее практической реализации: последние не должны присутствовать в платформенно"=независимой модели.
en_gb: However, in the MDA specifications, the details of describing the behavior of the system from the user point of view must be free of thee details of its implementation: the latter should not be present in the PIM.

source: Однако спецификация никак не оговаривает способы и технологии трансформации таких моделей.
en_gb: (?) However, the specification of the software to be gnerated does not prescribe the ways of transformation of the models.

source: Однако у такого подхода имеется ряд недостатков, которые делают его малопригодным для использования в рассматриваемой методике синтеза программного кода.
en_gb: (SHT)However, this approach has several drawbacks that make it less productive.

source: Однако этот способ требует от разработчика высокой математической квалификации и не соответствует современному стилю программирования.
en_gb: (SKIP)

source: Одним из подходов, реализующих концепцию порождающего программирования, является MDA.
en_gb: (?) One of the approaches for implementing concept of generative programming, is MDA.

source: Одним из подходов, реализующих концепцию порождающего программирования, является MDA.~Особенности спецификации MDA состоят в том, что в ней представлены виды моделей, которые требуется модифицировать с целью получения исходного программного кода.
en_gb: (?) One of the approaches for implementing concept of generative programming, is MDA. MDA is based on a set of models to be modified in oreder to obtain the source code.

source: Одним из способов представления PIM является UML.
en_gb: One way to represent PIM is UML,

source: Одним из способов представления PIM является UML.~При разработке 13М1 -диаграмма является как средством формального описания системы, так и средством ее документирования для разработчика.
en_gb: One way to represent PIM is UML, and in a development process UML diagrams are the language for formal description of the system, as well as means of documenting.
